In [1]:
# pandas Series
# Read DataFrame from excel
###########################

import pandas as pd
pd.__version__

'0.23.0'

In [4]:
series = pd.Series(['a','b','c'])
series

0    a
1    b
2    c
dtype: object

In [5]:
series[2]

'c'

In [13]:
series = pd.Series(['a', 'b', 'c'], index=[3, -1, 3])
series

 3    a
-1    b
 3    c
dtype: object

In [8]:
series.index

Int64Index([3, 2, 3], dtype='int64')

In [14]:
series[3]

3    a
3    c
dtype: object

In [16]:
series[-1]

'b'

In [18]:
df = pd.DataFrame([
    [100, 230, 90],
    [140, 150, 40],
    [210, 122, 50]
])
df

     0    1   2
0  100  230  90
1  140  150  40
2  210  122  50

In [19]:
df[1]

0    230
1    150
2    122
Name: 1, dtype: int64

In [20]:
df.loc[1]

0    140
1    150
2     40
Name: 1, dtype: int64

In [21]:
df[3] = [1, 3, 5]

In [22]:
df

     0    1   2  3
0  100  230  90  1
1  140  150  40  3
2  210  122  50  5

In [23]:
df.loc[3] = [3 , 2, 1] #이건 안되네
df

ValueError: cannot set a row with mismatched columns

In [27]:
df = pd.read_excel('data/score.xlsx')
print(df.shape)
df.head()

(3, 4)

   이름   국어  수학  영어
0  철수  100  70  80
1  영희   90  94  90
2  잡스   80  96  85

In [28]:
df = df.set_index('이름')
df

     국어  수학  영어
이름
철수  100  70  80
영희   90  94  90
잡스   80  96  85

In [29]:
df.loc['영희']

국어    90
수학    94
영어    90
Name: 영희, dtype: int64

In [30]:
df['수학']

이름
철수    70
영희    94
잡스    96
Name: 수학, dtype: int64

In [31]:
df['평균'] = (df['국어'] + df['수학'] + df['영어']) // 3

In [32]:
df

     국어  수학  영어  평균
이름
철수  100  70  80  83
영희   90  94  90  91
잡스   80  96  85  87

In [33]:
df.to_excel('data/score_result.xlsx')

In [35]:
pd.read_excel('data/score_result.xlsx')

   이름   국어  수학  영어  평균
0  철수  100  70  80  83
1  영희   90  94  90  91
2  잡스   80  96  85  87

In [ ]:
## Series는 주로 Dataframe의 행 또는 열 단위에 접근할 때, 많이 사용됨

In [37]:
## Series의 index 특성

ex = pd.DataFrame([
    ['일련번호이며 변경불가', '중복불가', '중복허용'],
    ['O', 'X', 'O']
],
    columns=['list/tuple의 index', 'dictionary의 key', 'Series의 index'], 
    index=['중복여부', '순서개념'])
ex

     list/tuple의 index dictionary의 key Series의 index
중복여부       일련번호이며 변경불가            중복불가          중복허용
순서개념                 O               X             O